IDENTIFICATION DIVISION.
PROGRAM-ID. MenuEmployes.
ENVIRONMENT DIVISION.
DATA DIVISION.
LINKAGE SECTION.
01  Choix PIC 9.
	88 ChoixOk VALUE 1 THRU 3.
	88 Fin VALUE 9.
PROCEDURE DIVISION USING Choix.
Debut.

	PERFORM TEST AFTER UNTIL ChoixOk OR Fin
		DISPLAY ' ' ERASE SCREEN
		DISPLAY 'GESTION DES EMPLOYES ' LINE 5 COLUMN 35
		DISPLAY '---------------------' LINE 6 COLUMN 35
		DISPLAY ' 1- Ajouter ', LINE 8 COLUMN 30
		DISPLAY ' 2- Rechercher ', LINE 9 COLUMN 30
		DISPLAY ' 3- Lister ', LINE 10 COLUMN 30
		DISPLAY ' 9- Quitter ', LINE 11 COLUMN 30
		ACCEPT Choix 
	END-PERFORM
	EXIT PROGRAM.