IDENTIFICATION DIVISION
PROGRAM-ID.	Donnees.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
       DECIMAL POINT IS COMMA.
DATA DIVISION.
WORKING-STORAGE SECTION.
77	X0 PIC 99 VALUE  2.
77	X1 PIC S9V9 VALUE  +2,3.
77	X2 PIC S99 VALUE -2.
77	X3 PIC S99 BINARY VALUE +48.
77	X4 PIC S9V9 BINARY VALUE +6,4.
77	X5 PIC S99 BINARY VALUE -1
77	X6 PIC S999 PACKED-DECIMAL VALUE +242.
77	X7  PIC S99V999 PACKED-DECIMAL VALUE -28292.
77	X-EDITE	PIC +Z9,99.
PROCEDURE DIVISION.
DeBUT
     DISPLAY 'PIC 99  VALUE  2  XXXX   : ' , X0.
     DISPLAY 'PIC S9V9 VALUE  +2,3  XXXX : ' , X1.
     DISPLAY 'PIC S99 VALUE -2  XXXX : ' , X2.
     DISPLAY 'PIC S99 BINARY VALUE +48  XXXX : ' , X3.
     DISPLAY 'PIC S99 BINARY VALUE +6,4  XXXX : ' , X4.
     DISPLAY 'PIC S99 BINARY VALUE -1  XXXX : ' , X5.
     DISPLAY 'PIC S999 PACKED-DECIMAL VALUE +242 ' , X6.
     DISPLAY 'PIC S99V999 PACKED-DECIMAL VALUE -28292' , X7.
               
    
     DISPLAY ' '.
     DISPLAY ' AFFICHAGE DE ZONES AVEC CONVERSION'
     DISPLAY ' ----------------------------------'
     DISPLAY X0  WITH CONVERSION.
     DISPLAY X1  WITH CONVERSION.
     DISPLAY X2  WITH CONVERSION.
     DISPLAY X3  WITH CONVERSION.
     DISPLAY X4  WITH CONVERSION.
     DISPLAY X5  WITH CONVERSION.
     DISPLAY X6  WITH CONVERSION.
     DISPLAY X7  WITH CONVERSION.
     
   
     DISPLAY ' '.
     DISPLAY ' AFFICHAGE DE ZONES EDITEES'
     DISPLAY ' ------------------------------'
     MOVE X0 TO X-EDITE.
     DISPLAY  X-EDITE.
     MOVE X1 TO X-EDITE.
     DISPLAY  X-EDITE.
     MOVE X2 TO X-EDITE.
     DISPLAY  X-EDITE.
     MOVE X3 TO X-EDITE.
     DISPLAY  X-EDITE.
     MOVE X4 TO X-EDITE.
     DISPLAY  X-EDITE.
     MOVE X5 TO X-EDITE.
     DISPLAY  X-EDITE.
     MOVE X6 TO X-EDITE.
     DISPLAY  X-EDITE.
     MOVE X7 TO X-EDITE.
     DISPLAY  X-EDITE.
         
     STOP RUN
