IDENTIFICATION DIVISION.
PROGRAM-ID. ReportSimple.
AUTHOR. Thiry Christiane.
 
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SPECIAL-NAMES.
      DECIMAL-POINT IS COMMA.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT f-input ASSIGN TO "ReportSimple.dat"
					ORGANIZATION LINE SEQUENTIAL.
       SELECT f-rapport	ASSIGN TO "ReportSimple.res".

 
DATA DIVISION.
FILE SECTION.
FD     f-input.
01     ENRG.   
       02   MATRICULE   PIC 9999.
       02   NOM         PIC X(30).
         88    FIN-DE-DONNEES VALUE HIGH-VALUE.
       02   ADRESSE     PIC X(30).
       02   LOCALITE    PIC X(20).
       02   CODEPOSTAL  PIC 9999.
       02   SEXE   	 PIC X.        
       02   NRSECTION   PIC 9999.   
       02   TOTAL       PIC S9999 USAGE COMP.
FD	f-rapport REPORT IS LISTE-ETUD.

WORKING-STORAGE SECTION.
01  NBRE-REC PIC S9(4) COMP VALUE 1.   
* Total calculé automatiquement par report system
* remis à zéro lors du CONTROL FOOTING FINAL
* doit être sauvé
01  TOTAL-REC-SAUV PIC Z.ZZZ.


 
REPORT SECTION.
RD  LISTE-ETUD
*    PAGE LIMIT IS 48
    PAGE LIMIT IS 66
    HEADING        1
    FIRST DETAIL   5
    LAST DETAIL   42
    FOOTING       45
       CONTROL IS FINAL.
01  REPORT-HEADER TYPE IS REPORT HEADING NEXT GROUP NEXT PAGE.
    02   LINE 24.
         03  COLUMN 20 PIC X(30) VALUE ALL "*".
    02   LINE 25.
         03  COLUMN 20 PIC X(30) VALUE "   SERVICE ELEVES INPRES  ".
    02   LINE 26.
         03  COLUMN 20 PIC X(30) VALUE  ALL "*".

01  TYPE IS PAGE HEADING.
    02   LINE 2.
         03   COLUMN 5   PIC X(25) VALUE "LISTE DES ETUDIANTS ".
         03   COLUMN 30  PIC X(5)  VALUE "PAGE ".
         03   COLUMN 35  PIC ZZZ9  SOURCE PAGE-COUNTER.
    02   LINE 3.
         03   COLUMN 5   PIC X(40) VALUE ALL '*'.

01  DETAIL-LINE  TYPE DETAIL LINE PLUS 2.
    02   COLUMN 5    PIC 9999   SOURCE MATRICULE.
    02   COLUMN 10   PIC X(30)  SOURCE NOM.
*   02   COLUMN 45   PIC X(30)  SOURCE ADRESSE.
*   02   COLUMN 80   PIC X(30)  SOURCE LOCALITE.
*   02   COLUMN 115  PIC 9999   SOURCE CODEPOSTAL.

01  FINAL-FOOTING TYPE IS CONTROL FOOTING FINAL 
                LINE PLUS 3.
* pas de clause COLUMN donc zone non imprimée
    02 TOTAL-REC               PIC Z.ZZZ SUM NBRE-REC.

01  REPORT-FOOTER TYPE IS REPORT FOOTING.
    02   LINE 24 ON NEXT PAGE.
         03  COLUMN 20 PIC X(30) VALUE ALL "*".
    02   LINE 25.
         03  COLUMN 20 PIC X(30) VALUE "   SERVICE ELEVES INPRES  ".
    02   LINE 26.
         03  COLUMN 20 PIC X(30) VALUE ALL "*".
    02   LINE 27.
         03   COLUMN 20  PIC X(16)  VALUE "NBRE DE PAGES ".
         03   COLUMN 36  PIC ZZZ9  SOURCE PAGE-COUNTER.
    02   LINE 28.
         03   COLUMN 20  PIC X(16) VALUE "TOTAL RECORDS : ".
         03   COLUMN 36  PIC Z.ZZZ SOURCE TOTAL-REC-SAUV.



PROCEDURE DIVISION.
DEBUT.
    PERFORM
       OPEN INPUT f-input
       OPEN OUTPUT f-rapport
       READ f-input AT END MOVE HIGH-VALUE TO NOM OF ENRG
       END-READ
       INITIATE LISTE-ETUD
       COMPUTE PAGE_COUNTER = PAGE_COUNTER - 1 
    END-PERFORM.

    PERFORM UNTIL FIN-DE-DONNEES
       GENERATE DETAIL-LINE
       READ f-input AT END MOVE HIGH-VALUE TO NOM OF ENRG
       END-READ
    END-PERFORM.

    COMPUTE PAGE_COUNTER = PAGE_COUNTER - 1. 
    MOVE TOTAL-REC TO TOTAL-REC-SAUV.
    TERMINATE LISTE-ETUD.
    CLOSE f-input f-rapport.
    STOP RUN.

